logs/hey-results.log

Summary:
  Total:	20.0943 secs
  Slowest:	0.2998 secs
  Fastest:	0.0702 secs
  Average:	0.1016 secs
  Requests/sec:	98.2366
  

Response time histogram:
  0.070 [1]	|
  0.093 [899]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.116 [725]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.139 [231]	|■■■■■■■■■■
  0.162 [53]	|■■
  0.185 [20]	|■
  0.208 [18]	|■
  0.231 [12]	|■
  0.254 [7]	|
  0.277 [5]	|
  0.300 [3]	|


Latency distribution:
  10% in 0.0799 secs
  25% in 0.0856 secs
  50% in 0.0949 secs
  75% in 0.1081 secs
  90% in 0.1278 secs
  95% in 0.1463 secs
  99% in 0.2218 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0702 secs, 0.2998 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0011 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0047 secs
  resp wait:	0.1013 secs, 0.0700 secs, 0.2977 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0152 secs

Status code distribution:
  [200]	827 responses
  [500]	1147 responses



----------------------------------------

Summary:
  Total:	20.1133 secs
  Slowest:	0.3090 secs
  Fastest:	0.0708 secs
  Average:	0.1157 secs
  Requests/sec:	86.2118
  

Response time histogram:
  0.071 [1]	|
  0.095 [422]	|■■■■■■■■■■■■■■■■■■■■■■■
  0.118 [729]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.142 [335]	|■■■■■■■■■■■■■■■■■■
  0.166 [131]	|■■■■■■■
  0.190 [52]	|■■■
  0.214 [39]	|■■
  0.238 [12]	|■
  0.261 [2]	|
  0.285 [4]	|
  0.309 [7]	|


Latency distribution:
  10% in 0.0869 secs
  25% in 0.0949 secs
  50% in 0.1082 secs
  75% in 0.1274 secs
  90% in 0.1535 secs
  95% in 0.1793 secs
  99% in 0.2281 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0708 secs, 0.3090 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0024 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0010 secs
  resp wait:	0.1154 secs, 0.0707 secs, 0.3086 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0093 secs

Status code distribution:
  [200]	684 responses
  [500]	1050 responses



----------------------------------------